
special_char2kor = {
    'A': '에이',
    'B': '비',
    'C': '씨',
    'D': '디',
    'E': '이',
    'F': '에프',
    'G': '지',
    'H': '에이치',
    'I': '아이',
    'J': '제이',
    'K': '케이',
    'L': '엘',
    'M': '엠',
    'N': '엔',
    'O': '오',
    'P': '피',
    'Q': '큐',
    'R': '알',
    'S': '에스',
    'T': '티',
    'U': '유',
    'V': '브이',
    'W': '더블유',
    'X': '엑스',
    'Y': '와이',
    'Z': '지',
    '.': '닷',
    ':': '콜론',
    '/': '슬래시',
    '0': '공',
    '1': '일',
    '2': '이',
    '3': '삼',
    '4': '사',
    '5': '오',
    '6': '육',
    '7': '칠',
    '8': '팔',
    '9': '구',
    '-': ',',
    '(': '소괄호',
    ')': '대괄호',
    '[': '대괄호',
    ']': '대괄호',
    '{': '중괄호',
    '}': '중괄호',
    '_': '언더바',
    '@': '골뱅이',
}

def special_char_to_hangul(special_char_text):
    ret = ''
    for char in special_char_text:
        char = char.upper()
        try:
            ret += ' ' + special_char2kor[char]
        except KeyError:
            ret += ' ' + char
    return ret
